# import library

# import dataset

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('HR.csv')
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

# shape

In [3]:
df.shape

(14999, 10)

# create new df

In [4]:
ndf = df[['satisfaction_level','average_montly_hours','promotion_last_5years','salary']]
ndf.head()

   satisfaction_level  average_montly_hours  promotion_last_5years  salary
0                0.38                   157                      0     low
1                0.80                   262                      0  medium
2                0.11                   272                      0  medium
3                0.72                   223                      0     low
4                0.37                   159                      0     low

# create dummies

In [5]:
dum = pd.get_dummies(ndf.salary,prefix='salary')
dum.head()

   salary_high  salary_low  salary_medium
0            0           1              0
1            0           0              1
2            0           0              1
3            0           1              0
4            0           1              0

# concat ndf and dummies

In [6]:
ddf = pd.concat([ndf,dum],axis='columns')
ddf.head()

,satisfaction_level,average_montly_hours,promotion_last_5years,salary,salary_high,salary_low,salary_medium
0,0.38,157,0,low,0,1,0
1,0.80,262,0,medium,0,0,1
2,0.11,272,0,medium,0,0,1
3,0.72,223,0,low,0,1,0
4,0.37,159,0,low,0,1,0

# drop salary column

In [7]:
ddf.drop('salary',axis='columns',inplace=True)

In [8]:
ddf.head()

,satisfaction_level,average_montly_hours,promotion_last_5years,salary_high,salary_low,salary_medium
0,0.38,157,0,0,1,0
1,0.80,262,0,0,0,1
2,0.11,272,0,0,0,1
3,0.72,223,0,0,1,0
4,0.37,159,0,0,1,0

# Train test split

In [9]:
from sklearn.model_selection import train_test_split as tts

In [10]:
X = ddf

In [11]:
y = df.left

In [12]:
X_train, X_test, y_train, y_test = tts(X, y,train_size=0.8,random_state=10)

In [13]:
len(X_train)

11999

In [15]:
len(X_test)

3000

# Logistic Regression Algorithm

In [16]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()

# fit the model

In [17]:
model.fit(X_train,y_train)

LogisticRegression()

# predict

In [18]:
model.predict(X_test)

array([0, 0, 0, ..., 1, 0, 0], dtype=int64)

# Accuracy

In [19]:
model.score(X_test,y_test)

0.7706666666666667

In [20]:
model.score(X_train,y_train)

0.7774814567880657